{
  "InvalidBuildRequest": "Requête de build non valide",
  "BuildNotFound": "La build {0} n'existe pas",
  "BuildUploaded": "Charge utile de la requête de build chargée sur le serveur.",
  "BuildExtracted": "Extraction effectuée des contenus d'application à partir de la requête de build chargée",
  "BuildBuilding": "Build de l’application Cordova.",
  "BuildComplete": "Build réussie.",
  "BuildDownloaded": "Build réussie et téléchargée par le client.",
  "EmulateDisabled": "L'émulation n'est pas activée sur ce serveur.",
  "NoResourcesForLanguage": "Aucune ressource définie pour la langue {0}",
  "BuildRetentionPreDelete": "Suppression des builds éligibles. {0} builds vont être supprimées.",
  "BuildRetentionDelete": "Suppression de la build {0} dans {1}",
  "BuildManagerDirInit": "La build va être exécutée sous : {0}",
  "LogFileReadError": "Erreur durant la lecture du fichier journal de génération {0} :",
  "UploadSavedSuccessfully": "Build chargée enregistrée dans {0}",
  "UploadSaving": "Enregistrement du contenu de la requête de build dans : {0}",
  "ErrorSavingTgz": "Une erreur s'est produite durant l'enregistrement du fichier tgz chargé sur {0} : {1}",
  "UploadExtractedSuccessfully": "Le contenu de l’application de la requête de build téléchargée a été extrait sur {0}. Création d’une requête de build.",
  "NewBuildQueued": "Build en cours de génération. Mise en file d'attente {0}",
  "NewBuildStarted": "Sélection de {0} comme build actuelle",
  "BuildDirectoryNotFound": "Le répertoire de build {0} n'existe pas.",
  "BuildMovingOn": "Build actuelle terminée. Recherche de la prochaine build en file d'attente.",
  "MalformedBuildInfo": "Le package approprié est introuvable pour la build spécifiée",
  "NewBuildSubmitted": "Nouvelle requête de build envoyée :",
  "BuildQueueFull": "Requête de build rejetée. La file d'attente de builds est pleine. La limite est de {0} builds en file d'attente.",
  "FailedCreateDirectory": "Impossible de créer le répertoire d'extraction {0} : {1}",
  "NoTgzFound": "Le fichier tgz de build n'existe plus dans le système de fichiers sur {0}",
  "TgzExtractError": "Une erreur s'est produite durant l'extraction du contenu de {0} : {1}",
  "AttemptedDeleteFileOutsideProject": "Avertissement : la build a demandé la suppression du fichier '{0}'",
  "BuildInvokedTwice": "Requête non valide : le processus build.js est déjà utilisé, mais il est sollicité pour une autre build. Il s'agit probablement d'une erreur de programmation, car le processus build.js est destiné à n'être utilisé qu'une seule fois.",
  "BuildNotCompleted": "La build demandée n'est pas encore prête. Statut : {0}",
  "ExceededMaxPings": "Dépassement du nombre maximal de tests Ping : {0}",
  "CordovaAcquisitionFailed": "Échec du chargement de Cordova {0} : {1}",
  "FirstRunDependencyConfiguration": "Configuration des dépendances liées à la première exécution.\nPour effectuer un déploiement sur des appareils iOS physiques, ou pour déboguer un appareil ou un simulateur, nous avons besoin de quelques packages d'Homebrew, un gestionnaire de package tiers.\nDurant l'installation d'Homebrew, vous pouvez être amené à indiquer un mot de passe d'administrateur. Voulez-vous continuer ?",
  "HomebrewInstallationQuery": "[o]/n ? ",
  "HomebrewInstallationQueryResponse": "o",
  "HomebrewInstallationFailed": "Erreur durant l'installation des packages homebrew :\n{0}",
  "HomebrewPackageVerificationFailed": "Erreur durant la vérification des packages homebrew :\n{0}\nUtilisez \"brew reinstall libimobiledevice ios-webkit-debug-proxy ideviceinstaller\", puis réessayez.",
  "HomebrewInstallationSuccess": "Installation réussie des packages homebrew.\n",
  "HomebrewInstallationDeclined": "Si vous souhaitez activer le déploiement sur des appareils, ou le débogage d'applications sur des appareils ou le simulateur, supprimez {0} pour que la question vous soit reposée.\n",
  "TacoRemoteHelpDescription": "taco-remote permet de générer des projets Apache Cordova à distance.",
  "TacoRemoteHelpNotes": "Vous trouverez de la documentation supplémentaire pour la configuration d'une build distante taco à l'adresse suivante : <link>http://go.microsoft.com/fwlink/?LinkId=618174</link>",
  "TacoRemoteHelpExample": "Utilisez le fichier config suivant pour configurer le port remotebuild, le port du proxy de débogage web, l'absence de rétention de builds, ainsi que le nettoyage de build au moment de l'arrêt",
  "TacoRemoteConfigAllowsEmulate": "true si le serveur doit prendre en charge les builds en cours d'exécution dans iOS Simulator, sinon false (true par défaut, si rien n'est spécifié)",
  "TacoRemoteConfigDeleteBuildsOnShutdown": "Supprimer toutes les builds quand le serveur est arrêté (true par défaut, si rien n'est spécifié)",
  "TacoRemoteConfigMaxBuildsInQueue": "Nombre maximal de builds à autoriser dans la file d'attente de builds. Les nouvelles builds au-delà de cette limite sont rejetées (10 par défaut, si rien n'est spécifié)",
  "TacoRemoteConfigMaxBuildsToKeep": "Nombre maximal de builds à conserver sur le disque (20 par défaut, si rien n'est spécifié)",
  "TacoRemoteConfigNativeDebugProxyPort": "Numéro de port du débogueur natif (3001 par défaut, si rien n'est spécifié)",
  "TacoRemoteConfigWebDebugProxyDevicePort": "Numéro de port pour la découverte d'appareils du débogueur webkit (9221 par défaut, si rien n'est spécifié)",
  "TacoRemoteConfigWebDebugProxyPortMin": "Premier numéro de port pour le débogueur webkit à affecter aux appareils (9222 par défaut, si rien n'est spécifié)",
  "TacoRemoteConfigWebDebugProxyPortMax": "Dernier numéro de port pour le débogueur webkit à affecter aux appareils (9322 par défaut, si rien n'est spécifié)"
}