{
  "IndexPageContent": "Server Express di compilazione remota aperto per le operazioni sulla porta {0}",
  "NoServerModulesSelected": "Avviso: non sono stati selezionati moduli server. Verrà usata la configurazione predefinita \"modules\": {\"taco-remote\": { \"mountPath\": \"cordova\"} }",
  "UnableToLoadModule": "Errore: non è possibile caricare il modulo {0}. Provare a eseguire 'npm install {0}' o a specificare il percorso completo del pacchetto",
  "InvalidPortSpecified": "La porta specificata '{0}' non è valida. Per la porta è necessario specificare un intero compreso tra 0 e 65536",
  "UnauthorizedClientRequest": "Il server di compilazione remota ha rifiutato la richiesta di compilazione perché il certificato client non è valido o è scaduto. Per compilare il progetto, è necessario generare e configurare un PIN di sicurezza. Vedere http://go.microsoft.com/fwlink/?LinkID=511904.",
  "InvalidPIN": "PIN non valido nella richiesta",
  "ClientCertNotFoundForPIN": "Il certificato client per il PIN non è stato trovato",
  "CAFilesNotFound": "Uno o entrambi i file CA obbligatori {0} e {1} non sono stati trovati.",
  "NoResourcesForLanguage": "Non sono state definite risorse per la lingua {0}",
  "UnknownCommand": "Comando sconosciuto: {0}",
  "CommandStartDescription": "Avvia il server",
  "CommandCertificatesDescription": "Aggiorna i certificati SSL client/server per una connessione protetta",
  "CommandGenerateDescription": "Genera un nuovo certificato SSL client per la configurazione di una nuova connessione protetta",
  "CommandResetDescription": "Reimposta i certificati SSL server",
  "CommandVersionDescription": "Visualizza la versione corrente di remotebuild",
  "CommandHelpDescription": "Visualizza le informazioni della Guida relative a un comando o a un modulo",
  "CommandSaveConfigDescription": "Salva la configurazione specificata in un file.",
  "SavedConfig": "La configurazione è stata salvata in {0}.",
  "CheckSettingsForInfo": "Visualizzare/modificare la configurazione server in {0}. Per generarla, potrebbe essere necessario eseguire 'remotebuild saveconfig'. Se si aggiornano le configurazioni server, sarà necessario riavviare il server.",
  "RemoteBuildStartExample1": "Avvia il server con tutte le impostazioni predefinite (server protetto con serverDir $TACO_HOME/remote-builds, porta 3000)",
  "RemoteBuildStartExample2": "Avvia il server con valori diversi per serverDir, porta e http (non protetto)",
  "GenerateClientCertExample1": "Genera un nuovo certificato da usare nel client che scadrà tra un anno",
  "ResetServerCertExample1": "Reimposta i certificati del server in modo che scadano tra un anno",
  "RemoteBuildModuleHelpText": "Altre opzioni sono descritte nei singoli moduli. Provare a richiedere la Guida per i moduli seguenti: {0}.<br/>Ad esempio, 'remotebuild help taco-remote'",
  "RemoteBuildConfConfigFile": "Percorso del file di configurazione che specifica i valori predefiniti per remotebuild",
  "UnableToFindModule": "Non è possibile caricare il modulo '{0}'.",
  "RemoteBuildConfConfig": "Percorso del file json di configurazione del server con una qualsiasi di queste impostazioni. Se non è specificata, viene usato il percorso predefinito $TACO_HOME/RemoteBuild.config",
  "RemoteBuildConfServerDir": "Directory radice del server. Se non è specificata, viene usata l'impostazione predefinita $TACO_HOME/remote-builds",
  "RemoteBuildConfLang": "Lingua da usare per l'output della console. Se non è specificata, verrà usata la lingua predefinita fornita da $LANG",
  "RemoteBuildConfPort": "Numero di porta del server. Se non è specificata, viene usata l'impostazione predefinita 3000",
  "RemoteBuildConfSecure": "È true per https con certificati SSL server/client; è false per http semplice. Se non è specificata, viene usata l'impostazione predefinita true",
  "RemoteBuildConfPinTimeout": "Tempo in minuti entro cui è possibile acquisire i certificati SSL del client. Impostazione predefinita: 10 minuti",
  "RemoteBuildConfHostname": "Nome host per cui generare i certificati SSL in modalità protetta. Impostazione predefinita: os.hostname()",
  "RemoteBuildConfCertExpirationDays": "Numero di giorni trascorsi i quali i certificati SSL generati scadono. Se non è specificata, viene usata l'impostazione predefinita pari a 5 anni",
  "RemoteBuildNotes1": "Opzioni (tutte le opzioni eccetto --config possono essere specificate tramite un file di configurazione)",
  "RemoteBuildNotes2": "Le opzioni della riga di comando hanno la precedenza sui valori dei file di configurazione",
  "OSXCertSetupInformation": [
    "Per usare questo agente, fare riferimento alle informazioni seguenti in Visual Studio, accessibili selezionando Strumenti, Opzioni, Strumenti per Apache Cordova, Configurazione agente remoto:",
    "",
    "Abilita elaborazione iOS remota: True",
    "Host: {0}",
    "Porta: {1}",
    "Modalità protetta: True",
    "PIN di sicurezza: {2}",
    "",
    "In alternativa, per usare taco-cli, eseguire 'taco remote add <PIATTAFORMA>' per configurare l'interfaccia della riga di comando taco in modo da usare questo server di compilazione per la piattaforma scelta, specificando",
    "Host: {0}",
    "Porta: {1}",
    "PIN: {2}"
  ],
  "OSXCertSetupNoPinTimeout": "Il PIN di sicurezza è monouso. Per generare altri PIN, usare il comando seguente:",
  "OSXCertSetupPinTimeout": "Il PIN di sicurezza è monouso e scadrà tra {0} minuti. Per generare altri PIN, usare il comando seguente:",
  "CertExpirationInvalid": "Se si specifica {0} per certExpirationDays, i certificati scadranno. Verrà usata la scadenza predefinita dei certificati, pari a {1} giorni.",
  "CertificatesNotConfigured": "Errore: i certificati non sono stati ancora inizializzati.",
  "OSXResetServerCertQuery": "Avviso: questo comando consente di eliminare tutti i certificati client correnti. Sarà necessario generare e configurare un nuovo PIN di sicurezza. Continuare? [S]ì o [N]o",
  "OSXNoteAfterResetServerCert": "Nota: per usare i nuovi certificati, è prima necessario riavviare eventuali server remotebuild in esecuzione.",
  "OSXResetServerCertResponseYes": [
    "s",
    "sì"
  ],
  "OSXResetServerCertResponseNo": [
    "n",
    "no"
  ],
  "OSXResetServerCertPleaseYesNo": "Rispondere [S]ì o [N]o.",
  "CommandTestDescription": "Esegue i test su remotebuild",
  "CommandTestDevice": "Verifica che il computer sia configurato per le compilazioni del dispositivo",
  "RemoteBuildTestExample1": "Esegue i test su un server avviato usando tutte le impostazioni predefinite",
  "RemoteBuildTestExample2": "Esegue i test del dispositivo su un server avviato con 'remotebuild --config config.json'",
  "RunningAsRootError": "****** remotebuild non deve essere eseguito come radice. L'esecuzione verrà arrestata.",
  "ServerStartFailed": "****** Non è stato possibile avviare il server: {0}",
  "InsecureServerStarted": "Server di compilazione remota in ascolto sulla porta [http] {0}",
  "SecureServerStarted": "Server di compilazione remota in ascolto sulla porta [https] {0}",
  "ServerPortInUse": "Non è possibile avviare il server sulla porta {0}. L'indirizzo è già in uso.",
  "UncaughtErrorShutdown": "****** Il server verrà arrestato a causa di un errore non rilevato ****** ",
  "ServerShutdown": "****** Esecuzione delle procedure di arresto server in corso.",
  "TestFailed": "Errore: il test di {0} non è riuscito.",
  "TestPassed": "Test di {0} superato."
}