{
  "InvalidBuildRequest": "Solicitação de compilação inválida",
  "BuildNotFound": "A compilação {0} não existe",
  "BuildUploaded": "Conteúdo de solicitação de compilação carregado.",
  "BuildExtracted": "Conteúdo de aplicativo extraído da solicitação de compilação carregada",
  "BuildBuilding": "Compilando o aplicativo Cordova.",
  "BuildComplete": "Compilação concluída com êxito.",
  "BuildDownloaded": "Compilação concluída e baixada pelo cliente.",
  "EmulateDisabled": "A emulação não está habilitada neste servidor.",
  "NoResourcesForLanguage": "Nenhum recurso definido para o idioma {0}",
  "BuildRetentionPreDelete": "Excluindo compilações elegíveis. {0} compilações serão excluídas.",
  "BuildRetentionDelete": "Excluindo compilação {0} de {1}",
  "BuildManagerDirInit": "A compilação será executada em: {0}",
  "LogFileReadError": "Erro de leitura do arquivo {0} de log da compilação:",
  "UploadSavedSuccessfully": "Compilação carregada salva em {0}",
  "UploadSaving": "Salvando conteúdo da solicitação da compilação em: {0}",
  "ErrorSavingTgz": "Ocorreu um erro ao salvar o arquivo tgz carregado em {0}: {1}",
  "UploadExtractedSuccessfully": "Conteúdo do aplicativo extraído da solicitação da compilação carregada para {0}. Solicitando compilação.",
  "NewBuildQueued": "Uma compilação está atualmente sendo compilada. Colocando na fila {0}",
  "NewBuildStarted": "Considerando {0} como a compilação atual",
  "BuildDirectoryNotFound": "O diretório de compilação {0} não existe.",
  "BuildMovingOn": "Configuração atual concluída. Verificando a próxima compilação na fila.",
  "MalformedBuildInfo": "Não foi possível encontrar o pacote apropriado para a compilação especificada",
  "NewBuildSubmitted": "Nova solicitação de compilação enviada:",
  "BuildQueueFull": "Solicitação de compilação rejeitada. A fila de compilação está cheia. O limite é de {0} compilações na fila.",
  "FailedCreateDirectory": "Não foi possível criar o diretório de extração {0}: {1}",
  "NoTgzFound": "O arquivo tgz de compilação não existe mais no sistema de arquivos em {0}",
  "TgzExtractError": "Ocorreu um erro ao extrair o conteúdo de {0}: {1}",
  "AttemptedDeleteFileOutsideProject": "Aviso: a compilação solicitou a exclusão do arquivo '{0}'",
  "BuildInvokedTwice": "Solicitação inválida: o processo build.js já está sendo usado, mas foi solicitado a fazer uma nova compilação. Este é provavelmente um erro de programação, já que um processo build.js deve ser usado apenas uma vez.",
  "BuildNotCompleted": "A compilação solicitada ainda não está pronta. Status: {0}",
  "ExceededMaxPings": "O número máx. de pings foi excedido: {0}",
  "CordovaAcquisitionFailed": "Falha ao carregar o Cordova {0}: {1}",
  "FirstRunDependencyConfiguration": "Configurando as dependências da primeira execução.\nPara implantá-las em dispositivos iOS físicos ou para depurar um dispositivo ou simulador, precisamos de alguns pacotes da Homebrew, um gerenciador de pacotes terceiro.\nAo instalar o Homebrew, você pode ser solicitado a fornecer uma senha de administrador. Deseja continuar?",
  "HomebrewInstallationQuery": "[s]/n? ",
  "HomebrewInstallationQueryResponse": "s",
  "HomebrewInstallationFailed": "Erro ao instalar os pacotes do homebrew:\n{0}",
  "HomebrewPackageVerificationFailed": "Erro ao verificar os pacotes do homebrew:\n{0}\nConsidere a possibilidade de usar \"brew reinstall libimobiledevice ios-webkit-debug-proxy ideviceinstaller\" e tentar novamente.",
  "HomebrewInstallationSuccess": "Pacotes do homebrew instalados com êxito.\n",
  "HomebrewInstallationDeclined": "Se você deseja ativar a implantação para dispositivos ou a depuração de aplicativos em dispositivos ou no simulador, exclua {0} para ser solicitado novamente.\n",
  "TacoRemoteHelpDescription": "taco-remote permite a compilação remota de projetos do Apache Cordova.",
  "TacoRemoteHelpNotes": "Mais documentação para a configuração da compilação remota do TACO pode ser encontrada em <link>http://go.microsoft.com/fwlink/?LinkId=618174</link>",
  "TacoRemoteHelpExample": "Use o seguinte arquivo de configuração para configurar a porta de remotebuild, porta proxy de depuração da Web, retenção sem compilações e limpeza de compilação no desligamento",
  "TacoRemoteConfigAllowsEmulate": "true se o servidor deve dar suporte às compilações em execução no simulador iOS; false se não (o padrão é true, se não especificado)",
  "TacoRemoteConfigDeleteBuildsOnShutdown": "Exclui todas as compilações quando o servidor é desligado (o padrão é true, se não especificado)",
  "TacoRemoteConfigMaxBuildsInQueue": "Número máximo de compilações a ser permitidas na fila de compilação. Novas compilações acima desse limite serão rejeitadas (o padrão é 10, se não especificado)",
  "TacoRemoteConfigMaxBuildsToKeep": "Número máximo de compilações a ser retidas em disco (o padrão é 20, se não especificado)",
  "TacoRemoteConfigNativeDebugProxyPort": "Número de portas para o depurador nativo (o padrão é 3.001, se não especificado)",
  "TacoRemoteConfigWebDebugProxyDevicePort": "Número de portas de descoberta de dispositivo do depurador do kit da Web (o padrão é 9.221, se não especificado)",
  "TacoRemoteConfigWebDebugProxyPortMin": "Número da primeira porta para o depurador do kit da Web atribuir aos dispositivos (o padrão é 9.222, se não especificado)",
  "TacoRemoteConfigWebDebugProxyPortMax": "Número da última porta para o depurador do kit da Web atribuir aos dispositivos (o padrão é 9.322, se não especificado)"
}