{
  "InvalidBuildRequest": "Solicitud de compilación no válida",
  "BuildNotFound": "La compilación {0} no existe",
  "BuildUploaded": "Se subió la carga de solicitud de compilación.",
  "BuildExtracted": "Se extrajo el contenido de la aplicación desde la solicitud de compilación cargada",
  "BuildBuilding": "Compilando aplicación de Cordova.",
  "BuildComplete": "Compilación completada correctamente.",
  "BuildDownloaded": "El cliente completó y descargó la compilación.",
  "EmulateDisabled": "Emular no está habilitado en este servidor.",
  "NoResourcesForLanguage": "No hay recursos definidos para el idioma {0}",
  "BuildRetentionPreDelete": "Eliminando compilaciones válidas. Se eliminarán {0} compilaciones.",
  "BuildRetentionDelete": "Eliminando la compilación {0} de {1}",
  "BuildManagerDirInit": "La compilación se ejecutará en: {0}",
  "LogFileReadError": "Error al leer el archivo de registro {0} de la compilación:",
  "UploadSavedSuccessfully": "Se guardó la compilación descargada en {0}",
  "UploadSaving": "Guardando carga de solicitud de compilación en: {0}",
  "ErrorSavingTgz": "Se produjo un error al guardar el archivo tgz cargado en {0}: {1}",
  "UploadExtractedSuccessfully": "Se extrajo el contenido de la aplicación desde la solicitud de compilación cargada a {0}. Solicitando compilación.",
  "NewBuildQueued": "Actualmente se está realizando una compilación. Poniendo {0} en cola",
  "NewBuildStarted": "Tomando {0} como compilación actual",
  "BuildDirectoryNotFound": "El directorio de compilación {0} no existe.",
  "BuildMovingOn": "Se completó la compilación actual. Comprobando la siguiente compilación en cola.",
  "MalformedBuildInfo": "No se puede encontrar el paquete adecuado para la compilación especificada",
  "NewBuildSubmitted": "Nueva solicitud de compilación enviada:",
  "BuildQueueFull": "Solicitud de compilación rechazada. La cola de compilación está llena. El límite de compilaciones en cola es de {0}.",
  "FailedCreateDirectory": "No se puede crear el directorio de extracción {0}: {1}",
  "NoTgzFound": "El archivo tgz de compilación ya no existe en {0} dentro del sistema de archivos",
  "TgzExtractError": "Se produjo un error al extraer contenido de {0}: {1}",
  "AttemptedDeleteFileOutsideProject": "Advertencia: la compilación ha solicitado eliminar el archivo '{0}'",
  "BuildInvokedTwice": "Solicitud no válida: el proceso build.js ya está en uso, pero se volvió a solicitar su compilación. Es probable que sea un error de programación, ya que el proceso build.js solo debe usarse una vez.",
  "BuildNotCompleted": "La compilación solicitada aún no está lista. Estado: {0}",
  "ExceededMaxPings": "Se superó la cantidad máxima de pings: {0}",
  "CordovaAcquisitionFailed": "No se pudo cargar Cordova {0}: {1}",
  "FirstRunDependencyConfiguration": "Configurar dependencias por primera vez.\nPara implementar en dispositivos iOS físicos o para depurar un dispositivo o simulador, necesitamos algunos paquetes de Homebrew, un administrador de paquetes externo.\nAl instalar Homebrew, se le podría pedir una contraseña de administrador. ¿Desea continuar?",
  "HomebrewInstallationQuery": "¿[s]/n? ",
  "HomebrewInstallationQueryResponse": "s",
  "HomebrewInstallationFailed": "Error al instalar los paquetes de Homebrew:\n{0}",
  "HomebrewPackageVerificationFailed": "Error al comprobar los paquetes de Homebrew:\n{0}\nPuede usar \"brew reinstall libimobiledevice ios-webkit-debug-proxy ideviceinstaller\" y volver a intentarlo.",
  "HomebrewInstallationSuccess": "Los paquetes de Homebrew se instalaron correctamente.\n",
  "HomebrewInstallationDeclined": "Si desea habilitar la implementación en dispositivos o aplicaciones de depuración en dispositivos o el simulador, elimine {0} para que se vuelva a hacer la pregunta.\n",
  "TacoRemoteHelpDescription": "taco-remote permite compilar proyectos de Apache Cordova de forma remota.",
  "TacoRemoteHelpNotes": "Encontrará más documentación sobre la configuración de la compilación remota de taco en <link>http://go.microsoft.com/fwlink/?LinkId=618174</link>",
  "TacoRemoteHelpExample": "Use el siguiente archivo de configuración para configurar el puerto remotebuild, el puerto de proxy de depuración web, ninguna retención de compilaciones y la limpieza de aplicaciones después del apagado",
  "TacoRemoteConfigAllowsEmulate": "true si el servidor debe admitir la ejecución de compilaciones en el simulador de iOS, false si no (el valor predeterminado es true si no se especifica)",
  "TacoRemoteConfigDeleteBuildsOnShutdown": "Eliminar todas las compilaciones cuando el servidor esté apagado (si no se especifica, el valor predeterminado es true)",
  "TacoRemoteConfigMaxBuildsInQueue": "Cantidad máxima de compilaciones permitidas en la cola de compilaciones. Las compilaciones nuevas que queden fuera de este límite serán rechazadas (el valor predeterminado es 10 si no se especifica)",
  "TacoRemoteConfigMaxBuildsToKeep": "Cantidad máxima de compilaciones que se pueden retener en el disco (el valor predeterminado es 20 si no se especifica)",
  "TacoRemoteConfigNativeDebugProxyPort": "Número de puerto para el depurador nativo (el valor predeterminado es 3001 si no se especifica)",
  "TacoRemoteConfigWebDebugProxyDevicePort": "Número de puerto para la detección del dispositivo depurador webkit (el valor predeterminado es 9221 si no se especifica)",
  "TacoRemoteConfigWebDebugProxyPortMin": "Primer número de puerto que asigna el depurador webkit a los dispositivos (el valor predeterminado es 9222 si no se especifica)",
  "TacoRemoteConfigWebDebugProxyPortMax": "Último número de puerto que asigna el depurador webkit a los dispositivos (el valor predeterminado es 9322 si no se especifica)"
}