{
  "IndexPageContent": "Сервер удаленной сборки Express Server готов к работе через порт {0}",
  "NoServerModulesSelected": "Предупреждение. Серверные модули не выбраны. По умолчанию используется конфигурация \"modules\": {\"taco-remote\": { \"mountPath\": \"cordova\"} }",
  "UnableToLoadModule": "Ошибка. Не удалось загрузить модуль {0}. Попробуйте выполнить команду \"npm install {0}\" или указать полный путь к пакету",
  "InvalidPortSpecified": "Указан недопустимый порт \"{0}\". Порт должен быть целым числом в диапазоне от 0 до 65536",
  "UnauthorizedClientRequest": "Сервер удаленной сборки отклонил запрос сборки, так как сертификат клиента недопустим или его срок действия истек. Чтобы выполнить сборку проекта, необходимо создать и настроить ПИН-код безопасности. Сведения см. по ссылке http://go.microsoft.com/fwlink/?LinkID=511904.",
  "InvalidPIN": "Недопустимый ПИН-код в запросе",
  "ClientCertNotFoundForPIN": "Не удалось найти сертификат клиента для ПИН-кода",
  "CAFilesNotFound": "Не удалось найти один или оба требуемых файла ЦС {0} и {1}.",
  "NoResourcesForLanguage": "Нет ресурсов, определенных для языка {0}",
  "UnknownCommand": "Неизвестная команда: {0}",
  "CommandStartDescription": "Запускает сервер",
  "CommandCertificatesDescription": "Обновляет SSL-сертификаты клиента и сервера для защищенного подключения",
  "CommandGenerateDescription": "Создает новый SSL-сертификат клиента для настройки нового защищенного подключения",
  "CommandResetDescription": "Сбрасывает SSL-сертификаты сервера",
  "CommandVersionDescription": "Отображает текущую версию remotebuild",
  "CommandHelpDescription": "Получает справку по команде или модулю",
  "CommandSaveConfigDescription": "Сохраняет указанную конфигурацию в файл.",
  "SavedConfig": "Конфигурация успешно сохранена в {0}.",
  "CheckSettingsForInfo": "Просмотрите и измените конфигурацию сервера в \"{0}\". Для ее создания может потребоваться выполнение команды \"remotebuild saveconfig\". Необходимо перезапустить сервер, если конфигурация сервера была обновлена.",
  "RemoteBuildStartExample1": "Запуск сервера со всеми значениям по умолчанию (защищенный сервер с serverDir $TACO_HOME/remote-builds, укажите порт 3000)",
  "RemoteBuildStartExample2": "Запуск сервера с другим значением для serverDir, порта и HTTP (небезопасный)",
  "GenerateClientCertExample1": "Создание нового сертификата для использования клиентом, срок действия которого истекает через 1 год",
  "ResetServerCertExample1": "Сброс сертификатов сервера, срок действия которых истечет через год",
  "RemoteBuildModuleHelpText": "Другие параметры описаны в отдельных модулях. Попробуйте запросить справку для следующих модулей: {0}.<br/>Например, \"remotebuild help taco-remote\".",
  "RemoteBuildConfConfigFile": "Путь к файлу конфигурации, который указывает значения по умолчанию для экземпляра remotebuild",
  "UnableToFindModule": "Не удалось загрузить модуль \"{0}\".",
  "RemoteBuildConfConfig": "Путь к файлу конфигурации сервера JSON с любыми из этих параметров (если не указан, путь по умолчанию — $TACO_HOME/RemoteBuild.config)",
  "RemoteBuildConfServerDir": "Корневой каталог сервера (если не указан, значение по умолчанию — $TACO_HOME/remote-builds)",
  "RemoteBuildConfLang": "Язык, который следует использовать для вывода консоли (по умолчанию — язык, заданный $LANG, если язык не указан)",
  "RemoteBuildConfPort": "Номер порта для сервера (если не указан, значение по умолчанию — 3000)",
  "RemoteBuildConfSecure": "Значение true для протокола HTTPS с SSL-сертификатами серверов и клиентов; значение false для обычного протокола HTTP (значение по умолчанию — true)",
  "RemoteBuildConfPinTimeout": "Время в минутах, для которого можно получить SSL-сертификаты клиента (по умолчанию — 10 минут)",
  "RemoteBuildConfHostname": "Имя узла, для которого следует создать SSL-сертификаты при работе в безопасном режиме (по умолчанию — os.hostname())",
  "RemoteBuildConfCertExpirationDays": "Срок действия созданных SSL-сертификатов в днях (если не указан, значение по умолчанию — 5 лет)",
  "RemoteBuildNotes1": "Параметры (все параметры, кроме --config, могут быть указаны с помощью файла конфигурации)",
  "RemoteBuildNotes2": "Параметры командной строки переопределяют значения файла конфигурации",
  "OSXCertSetupInformation": [
    "Используйте следующую информацию в Visual Studio в разделе \"Сервис\", \"Параметры\", \"Средства для Apache Cordova\", \"Конфигурация удаленного агента\" для использования этого агента:",
    "",
    "Включить удаленную обработку iOS: True",
    "Узел: {0}",
    "Порт: {1}",
    "Безопасный режим: True",
    "ПИН-код безопасности: {2}",
    "",
    "Можно также использовать команду интерфейса командной строки taco \"taco remote add <платформа>\", чтобы настроить интерфейс командной строки taco для использования этого сервера сборки для выбранной платформы, указав",
    "Узел: {0}",
    "Порт: {1}",
    "ПИН-код: {2}"
  ],
  "OSXCertSetupNoPinTimeout": "ПИН-код безопасности предназначен для однократного использования. Чтобы создать дополнительные ПИН-коды, используйте следующую команду:",
  "OSXCertSetupPinTimeout": "ПИН-код безопасности предназначен для однократного использования. Срок его действия истечет через {0} мин. Чтобы создать дополнительные ПИН-коды, используйте следующую команду:",
  "CertExpirationInvalid": "Использование значения \"{0}\" параметра certExpirationDays приведет к просроченным сертификатам. Вместо него будет использоваться следующее значение срока действия сертификатов по умолчанию — {1} дн.",
  "CertificatesNotConfigured": "Ошибка. Сертификаты еще не инициализированы.",
  "OSXResetServerCertQuery": "Предупреждение. Эта команда удаляет все текущие сертификаты клиентов. Вам потребуется создать и настроить новый ПИН-код безопасности. Продолжить? Да (Y) или нет (N)",
  "OSXNoteAfterResetServerCert": "Примечание. Необходимо перезагрузить все серверы удаленной сборки перед тем, как использовать новые сертификаты.",
  "OSXResetServerCertResponseYes": [
    "y",
    "да"
  ],
  "OSXResetServerCertResponseNo": [
    "n",
    "нет"
  ],
  "OSXResetServerCertPleaseYesNo": "Ответьте \"да\" (Y) или \"нет\" (N).",
  "CommandTestDescription": "Выполняет тесты для remotebuild",
  "CommandTestDevice": "Проверяет, подходит ли конфигурация компьютера для сборок устройств",
  "RemoteBuildTestExample1": "Выполнение тестов для сервера, запущенного со всеми значениями по умолчанию",
  "RemoteBuildTestExample2": "Выполнение тестирования устройства для сервера, запущенного с \"remotebuild --config config.json\"",
  "RunningAsRootError": "****** remotebuild нельзя запускать в качестве корня. Завершение работы.",
  "ServerStartFailed": "****** Не удалось запустить сервер: {0}",
  "InsecureServerStarted": "Сервер удаленной сборки ожидает передачу данных через порт {0} [http]",
  "SecureServerStarted": "Сервер удаленной сборки ожидает передачу данных через порт {0} [https]",
  "ServerPortInUse": "Не удалось запустить сервер на порте {0}. Адрес уже используется.",
  "UncaughtErrorShutdown": "****** Сервер завершит работу из-за неперехваченной ошибки ****** ",
  "ServerShutdown": "****** Выполняется завершение работы сервера.",
  "TestFailed": "Ошибка. Тест {0} не пройден.",
  "TestPassed": "Тест {0} пройден."
}