{
  "IndexPageContent": "Serveur Express de builds distantes ouvert sur le port {0}",
  "NoServerModulesSelected": "Avertissement : aucun module serveur n'est sélectionné. Utilisation par défaut de la configuration \"modules\": {\"taco-remote\": { \"mountPath\": \"cordova\"} }",
  "UnableToLoadModule": "Erreur : impossible de charger le module {0}. Essayez d'exécuter 'npm install {0}' ou de spécifier le chemin d'accès complet du package",
  "InvalidPortSpecified": "Port '{0}' non valide spécifié. Le port doit être un entier compris entre 0 et 65536",
  "UnauthorizedClientRequest": "Le serveur de builds distant a rejeté la requête de build, car le certificat client n'est pas valide ou a expiré. Pour générer votre projet, vous devez générer et configurer un code PIN de sécurité. Consultez http://go.microsoft.com/fwlink/?LinkID=511904.",
  "InvalidPIN": "Code PIN non valide dans la requête",
  "ClientCertNotFoundForPIN": "Certificat client introuvable pour le code PIN",
  "CAFilesNotFound": "L'un des fichiers d'autorité de certification obligatoires, ou les deux {0} et {1}, sont introuvables.",
  "NoResourcesForLanguage": "Aucune ressource définie pour la langue {0}",
  "UnknownCommand": "Commande inconnue : {0}",
  "CommandStartDescription": "Démarre le serveur",
  "CommandCertificatesDescription": "Met à jour le certificat SSL client et le certificat SSL de serveur pour une connexion sécurisée",
  "CommandGenerateDescription": "Génère un nouveau certificat SSL client pour la configuration d'une nouvelle connexion sécurisée",
  "CommandResetDescription": "Réinitialise les certificats SSL de serveur",
  "CommandVersionDescription": "Affiche la version actuelle de remotebuild",
  "CommandHelpDescription": "Obtient de l'aide sur une commande ou un module",
  "CommandSaveConfigDescription": "Enregistre la configuration spécifiée dans un fichier.",
  "SavedConfig": "Configuration enregistrée correctement sur {0}.",
  "CheckSettingsForInfo": "Affichez/modifiez la configuration du serveur sur {0}. Vous devrez peut-être exécuter 'remotebuild saveconfig' pour la générer. Vous devrez redémarrer le serveur si vous mettez à jour ses configurations.",
  "RemoteBuildStartExample1": "Démarre le serveur avec toutes les valeurs par défaut (serveur sécurisé avec serverDir $TACO_HOME/remote-builds, port 3000)",
  "RemoteBuildStartExample2": "Démarre le serveur avec des valeurs différentes pour serverDir, port et http (non sécurisé)",
  "GenerateClientCertExample1": "Génère un nouveau certificat à utiliser dans le client, et qui expirera dans 1 an",
  "ResetServerCertExample1": "Réinitialise les certificats de serveur pour qu'ils expirent dans 1 an",
  "RemoteBuildModuleHelpText": "Les autres options sont décrites dans chaque module. Essayez de demander de l'aide sur les modules suivants : {0}.<br/>Exemple : 'remotebuild help taco-remote'",
  "RemoteBuildConfConfigFile": "Chemin du fichier config qui spécifie les valeurs par défaut de remotebuild",
  "UnableToFindModule": "Impossible de charger le module '{0}'.",
  "RemoteBuildConfConfig": "Chemin d'accès du fichier json de configuration du serveur avec ces paramètres ($TACO_HOME/RemoteBuild.config par défaut, si rien n'est spécifié)",
  "RemoteBuildConfServerDir": "Répertoire racine du serveur ($TACO_HOME/remote-builds par défaut, si rien n'est spécifié)",
  "RemoteBuildConfLang": "Langue à utiliser pour la sortie de la console (si elle n'est pas spécifiée, la langue par défaut est donnée par $LANG)",
  "RemoteBuildConfPort": "Numéro de port du serveur (3000 par défaut, si rien n'est spécifié)",
  "RemoteBuildConfSecure": "true pour https avec les certificats de serveur/clients SSL, false pour http (true par défaut, si rien n'est spécifié)",
  "RemoteBuildConfPinTimeout": "Période de temps en minutes pendant laquelle les certificats SSL clients peuvent être acquis (la valeur par défaut est de 10 minutes)",
  "RemoteBuildConfHostname": "Nom de l'hôte pour lequel générer des certificats SSL lors du fonctionnement en mode sécurisé (la valeur par défaut est os.hostname())",
  "RemoteBuildConfCertExpirationDays": "Nombre de jours au-delà desquels les certificats SSL générés doivent expirer (5 ans par défaut, si rien n'est spécifié)",
  "RemoteBuildNotes1": "Options (toutes les options autres que --config peuvent être spécifiées via un fichier config)",
  "RemoteBuildNotes2": "Les options de ligne de commande remplacent les valeurs du fichier config",
  "OSXCertSetupInformation": [
    "Utilisez les informations suivantes dans Visual Studio sous Outils, Options, Outils pour Apache Cordova, Configuration de l'agent distant pour utiliser cet agent :",
    "",
    "Activer le traitement iOS à distance : vrai",
    "Hôte : {0}",
    "Port : {1}",
    "Mode sécurisé : vrai",
    "Code PIN de sécurité : {2}",
    "",
    "Au lieu d'utiliser l'interface CLI Taco, exécutez 'taco remote add <PLATEFORME>' de façon à configurer l'interface CLI Taco pour qu'elle utilise ce serveur de builds pour la plateforme choisie, en spécifiant",
    "Hôte : {0}",
    "Port : {1}",
    "Code PIN : {2}"
  ],
  "OSXCertSetupNoPinTimeout": "Le code PIN de sécurité est à usage unique. Pour générer des codes confidentiels supplémentaires, utilisez la commande suivante :",
  "OSXCertSetupPinTimeout": "Le code PIN de sécurité est à usage unique et expire dans {0} minutes. Pour générer des codes confidentiels supplémentaires, utilisez la commande suivante :",
  "CertExpirationInvalid": "certExpirationDays {0} provoquerait l'expiration de certificats. Un délai d'expiration par défaut des certificats de {1} jours sera utilisé à la place.",
  "CertificatesNotConfigured": "Erreur : les certificats ne sont pas encore initialisés.",
  "OSXResetServerCertQuery": "Avertissement : cette commande supprime tous les certificats clients actuels. Vous devrez générer et configurer un nouveau code PIN de sécurité. Voulez-vous continuer ? [O]ui ou [N]on",
  "OSXNoteAfterResetServerCert": "Remarque : vous devez redémarrer les serveurs remotebuild en cours d'exécution avant d'utiliser les nouveaux certificats.",
  "OSXResetServerCertResponseYes": [
    "o",
    "oui"
  ],
  "OSXResetServerCertResponseNo": [
    "n",
    "non"
  ],
  "OSXResetServerCertPleaseYesNo": "Répondez par [O]ui ou [N]on.",
  "CommandTestDescription": "Exécute des tests relatifs à remotebuild",
  "CommandTestDevice": "Teste si la machine est configurée pour les builds d'appareil",
  "RemoteBuildTestExample1": "Exécute des tests relatifs à un serveur démarré avec toutes les valeurs par défaut",
  "RemoteBuildTestExample2": "Exécute des tests d'appareil relatifs à un serveur démarré avec 'remotebuild --config config.json'",
  "RunningAsRootError": "****** remotebuild ne doit pas être exécuté en tant que racine. Arrêt.",
  "ServerStartFailed": "****** Échec du démarrage du serveur : {0}",
  "InsecureServerStarted": "Serveur de builds distant à l'écoute sur [http], port {0}",
  "SecureServerStarted": "Serveur de builds distant à l'écoute sur [https], port {0}",
  "ServerPortInUse": "Impossible de démarrer le serveur sur le port {0}. Adresse déjà utilisée.",
  "UncaughtErrorShutdown": "****** Le serveur va s'arrêter en raison d'une erreur non interceptée ****** ",
  "ServerShutdown": "****** Exécution de procédures d'arrêt du serveur.",
  "TestFailed": "Erreur : échec du test {0}.",
  "TestPassed": "Réussite du test {0}."
}