{
  "IndexPageContent": "Vzdálený sestavovací server Express je otevřený na portu {0}.",
  "NoServerModulesSelected": "Upozornění: Nejsou vybrané žádné serverové moduly. Použijí se výchozí konfigurační \"modules\": {\"taco-remote\": { \"mountPath\": \"cordova\"} }",
  "UnableToLoadModule": "Chyba: Nejde načíst modul {0}. Zkuste spustit příkaz „npm install {0}“ nebo zadat úplnou cestu k balíčku.",
  "InvalidPortSpecified": "Zadaný port {0} je neplatný. Port musí být celé číslo mezi 0 a 65536",
  "UnauthorizedClientRequest": "Vzdálený buildovací server zamítl žádost o sestavení, protože klientský certifikát je neplatný nebo prošlý. Pokud chcete projekt sestavit, musíte vygenerovat a nakonfigurovat bezpečnostní kód PIN. Viz http://go.microsoft.com/fwlink/?LinkID=511904.",
  "InvalidPIN": "Neplatný kód PIN v žádosti",
  "ClientCertNotFoundForPIN": "Nenašel se klientský certifikát pro kód PIN.",
  "CAFilesNotFound": "Jeden nebo oba povinné soubory certifikační autority {0} a {1} se nenašly.",
  "NoResourcesForLanguage": "Pro jazyk {0} nejsou definované žádné prostředky.",
  "UnknownCommand": "Neznámý příkaz: {0}",
  "CommandStartDescription": "Spustí server.",
  "CommandCertificatesDescription": "Aktualizuje klientské/serverové certifikáty protokolu SSL pro zabezpečené připojení.",
  "CommandGenerateDescription": "Vygeneruje nový klientský certifikát protokolu SSL pro konfiguraci nového zabezpečeného připojení.",
  "CommandResetDescription": "Obnoví serverové certifikáty protokolu SSL.",
  "CommandVersionDescription": "Zobrazí aktuální verzi nástroje remotebuild.",
  "CommandHelpDescription": "Načte nápovědu pro příkaz nebo modul.",
  "CommandSaveConfigDescription": "Uloží vybranou konfiguraci do souboru.",
  "SavedConfig": "Konfigurace se úspěšně uložila do {0}.",
  "CheckSettingsForInfo": "Konfiguraci serveru si můžete prohlédnout nebo upravit v {0}. Možná si ji budete muset vygenerovat spuštěním remotebuild saveconfig. V případě aktualizace konfigurace serveru budete muset server restartovat.",
  "RemoteBuildStartExample1": "Spustí server se všemi výchozími hodnotami (zabezpečený server se serverDir $TACO_HOME/remote-builds, port 3000).",
  "RemoteBuildStartExample2": "Spustí server s jiným adresářem (serverDir), portem a protokolem http (v nezabezpečeném režimu).",
  "GenerateClientCertExample1": "Vygeneruje nový certifikát pro použití v klientovi, který vyprší za 1 rok.",
  "ResetServerCertExample1": "Obnoví serverové certifikáty tak, aby jejich platnost končila za 1 rok.",
  "RemoteBuildModuleHelpText": "Další možnosti jsou popsané v jednotlivých modulech. Zkuste si vyžádat nápovědu k následujícím modulům: {0}.<br/>Například remotebuild help taco-remote",
  "RemoteBuildConfConfigFile": "Cesta ke konfiguračnímu souboru, který určuje výchozí hodnoty pro remotebuild",
  "UnableToFindModule": "Nejde načíst modul {0}.",
  "RemoteBuildConfConfig": "Cesta k serverovému konfiguračnímu souboru json s některým z těchto nastavení (pokud není zadaná, použije se výchozí $TACO_HOME/RemoteBuild.config)",
  "RemoteBuildConfServerDir": "Kořenový adresář serveru (pokud není zadaný, použije se výchozí $TACO_HOME/remote-builds)",
  "RemoteBuildConfLang": "Jazyk, který se má použít pro výstup konzoly (standardně jazyk daný proměnnou $LANG, pokud není zadaný)",
  "RemoteBuildConfPort": "Číslo portu serveru (pokud není zadané, použije se výchozí hodnota 3000)",
  "RemoteBuildConfSecure": "Hodnota true pro https se serverovými/klientskými certifikáty SSL, hodnota false pro běžné http (pokud není zadaná, použije se výchozí hodnota true)",
  "RemoteBuildConfPinTimeout": "Doba v minutách, po kterou se dají získat klientské certifikáty SSL (výchozí je 10 minut)",
  "RemoteBuildConfHostname": "Název hostitele, pro který se mají vygenerovat certifikáty protokolu SSL, když se používá zabezpečený režim (výchozí je os.hostname())",
  "RemoteBuildConfCertExpirationDays": "Počet dní, po kterých vyprší platnost vygenerovaných certifikátů protokolu SSL (pokud není zadaný, použije se výchozích 5 let)",
  "RemoteBuildNotes1": "Možnosti (Prostřednictvím konfiguračního souboru se dají zadat všechny možnosti kromě --config.)",
  "RemoteBuildNotes2": "Možnosti příkazového řádku mají vyšší platnost než hodnoty v konfiguračním souboru.",
  "OSXCertSetupInformation": [
    "Pokud chcete použít tohoto agenta, použijte následující informace v sadě Visual Studio v nabídce Nástroje, Možnosti, Nástroje pro Apache Cordova, Konfigurace vzdáleného agenta:",
    "",
    "Zapnout vzdálené zpracování iOS: True",
    "Hostitel: {0}",
    "Port: {1}",
    "Zabezpečený režim: True",
    "Bezpečnostní kód PIN: {2}",
    "",
    "Pokud chcete použít taco-cli, spusťte příkaz taco remote add <platforma>, který nakonfiguruje taco CLI tak, že bude používat pro zvolenou platformu tento sestavovací server, a určí",
    "Hostitel: {0}",
    "Port: {1}",
    "Kód PIN: {2}"
  ],
  "OSXCertSetupNoPinTimeout": "Tento bezpečnostní kód PIN je jednorázový. K vygenerování dalších PINů použijte následující příkaz:",
  "OSXCertSetupPinTimeout": "Tento bezpečnostní kód PIN je jednorázový a vyprší během {0} minut. K vygenerování dalších PINů použijte následující příkaz:",
  "CertExpirationInvalid": "Výsledkem hodnoty certExpirationDays {0} by byly prošlé certifikáty. Použije se výchozí vypršení platnosti certifikátu {1} dnů.",
  "CertificatesNotConfigured": "Chyba: Certifikáty ještě nejsou inicializované!",
  "OSXResetServerCertQuery": "Upozornění: Tento příkaz odstraní všechny současné klientské certifikáty. Budete muset vygenerovat a nakonfigurovat nový bezpečnostní kód PIN. Chcete pokračovat? [A]no nebo [N]e",
  "OSXNoteAfterResetServerCert": "Poznámka: Je třeba restartovat všechny spuštěné servery remotebuild, než bude možné používat nové certifikáty.",
  "OSXResetServerCertResponseYes": [
    "a",
    "ano"
  ],
  "OSXResetServerCertResponseNo": [
    "n",
    "ne"
  ],
  "OSXResetServerCertPleaseYesNo": "Odpovězte prosím [A]no nebo [N]e.",
  "CommandTestDescription": "Spustí testy proti jiné instanci nástroje remotebuild.",
  "CommandTestDevice": "Otestuje, jestli je počítač nakonfigurovaný pro buildy zařízení.",
  "RemoteBuildTestExample1": "Spustí testy u serveru spuštěného s použitím všech výchozích hodnot.",
  "RemoteBuildTestExample2": "Spustí testy zařízení u serveru spuštěného s remotebuild --config config.json.",
  "RunningAsRootError": "****** Příkaz remotebuild by se neměl spouštět pod uživatelem root. Vypíná se.",
  "ServerStartFailed": "****** Nepovedlo se spustit server: {0}.",
  "InsecureServerStarted": "Vzdálený buildovací server naslouchá na portu [http] {0}.",
  "SecureServerStarted": "Vzdálený buildovací server naslouchá na portu [https] {0}.",
  "ServerPortInUse": "Server se nedá spustit na portu {0}. Tato adresa se už používá.",
  "UncaughtErrorShutdown": "****** Server se vypne kvůli nezachycené chybě. ****** ",
  "ServerShutdown": "****** Probíhají procedury vypínání serveru.",
  "TestFailed": "Chyba: Test modulu {0} byl neúspěšný.",
  "TestPassed": "Test modulu {0} byl úspěšný."
}