{
  "IndexPageContent": "Servidor Express de compilação remota aberto para negócios na porta {0}",
  "NoServerModulesSelected": "Aviso: nenhum módulo de servidor selecionado. Padronizando a configuração \"modules\": {\"taco-remote\": { \"mountPath\": \"cordova\"} }",
  "UnableToLoadModule": "Erro: não é possível carregar o módulo {0}. Tente executar 'npm install {0}' ou especificar o caminho completo para o pacote",
  "InvalidPortSpecified": "Porta inválida '{0}' especificada. Porta deve ser um número inteiro entre 0 e 65536",
  "UnauthorizedClientRequest": "O servidor de build remoto negou a solicitação de compilação, pois o certificado de cliente é inválido ou expirou. Para compilar seu projeto, você deve gerar e configurar um PIN de segurança. Consulte http://go.microsoft.com/fwlink/?LinkID=511904.",
  "InvalidPIN": "PIN inválido na solicitação",
  "ClientCertNotFoundForPIN": "Certificado de cliente não encontrado para o PIN",
  "CAFilesNotFound": "Um ou ambos os arquivos CA necessários {0} e {1} não encontrados.",
  "NoResourcesForLanguage": "Não há recursos definidos para idioma {0}",
  "UnknownCommand": "Comando desconhecido: {0}",
  "CommandStartDescription": "Inicia o servidor",
  "CommandCertificatesDescription": "Atualiza os certificados SSL do cliente/servidor para uma conexão segura",
  "CommandGenerateDescription": "Gera um novo certificado SSL de cliente para configurar uma nova conexão segura",
  "CommandResetDescription": "Restaura os certificados SSL do servidor",
  "CommandVersionDescription": "Exibe a atual versão de remotebuild",
  "CommandHelpDescription": "Obtém ajuda para um comando ou módulo",
  "CommandSaveConfigDescription": "Salva a configuração especificada em um arquivo.",
  "SavedConfig": "Configuração salva com êxito em {0}.",
  "CheckSettingsForInfo": "Exiba/edite a configuração do servidor em {0}. Pode ser necessário executar 'remotebuild saveconfig' para gerá-la. Se as configurações do servidor forem atualizadas, talvez seja necessário reiniciá-lo.",
  "RemoteBuildStartExample1": "Inicie o servidor com todos os padrões (servidor seguro com serverDir $TACO_HOME/remote-builds, porta 3000)",
  "RemoteBuildStartExample2": "Iniciar o servidor com um serverDir, porta e o http (não seguro) diferentes",
  "GenerateClientCertExample1": "Gera um novo certificado para uso no cliente que expirará em 1 ano",
  "ResetServerCertExample1": "Redefinir os certificados de servidor para expirar em 1 ano",
  "RemoteBuildModuleHelpText": "Outras opções são descritas nos módulos individuais. Tente pedir ajuda sobre os seguintes módulos: {0}.<br/>Por exemplo, 'remotebuild help taco-remote'",
  "RemoteBuildConfConfigFile": "Caminho para o arquivo de configuração que especifica valores padrão para remotebuild",
  "UnableToFindModule": "Não é possível carregar o módulo '{0}'.",
  "RemoteBuildConfConfig": "Caminho para o arquivo json de configuração do servidor com qualquer uma dessas configurações (padrão $TACO_HOME/RemoteBuild.config se não especificado)",
  "RemoteBuildConfServerDir": "Diretório raiz para o servidor (o padrão é $TACO_HOME/remote-builds se não especificado)",
  "RemoteBuildConfLang": "Idioma para usar na saída do console (padrões para o idioma fornecidos por $LANG, se não forem especificados)",
  "RemoteBuildConfPort": "Número da porta para o servidor (o padrão é 3.000, se não especificado)",
  "RemoteBuildConfSecure": "verdadeiro para https com certificados SSL servidor/cliente, falsos para http sem formatação (o padrão é verdadeiro se não estiver especificado)",
  "RemoteBuildConfPinTimeout": "Tempo em minutos para que os certificados SSL do cliente possam ser adquiridos (o padrão é 10 minutos)",
  "RemoteBuildConfHostname": "Nome do host para qual deve gerar certificados SSL quando estiver no modo de segurança (padrão para os.hostname())",
  "RemoteBuildConfCertExpirationDays": "Número de dias após o qual os certificados SSL gerados expirarão (o padrão é cinco anos se não for especificado)",
  "RemoteBuildNotes1": "Opções (Todas as outras opções que não sejam --config podem ser especificadas por meio de um arquivo de configuração)",
  "RemoteBuildNotes2": "As opções de linha de comando substituem os valores do arquivo de configuração",
  "OSXCertSetupInformation": [
    "Use as seguintes informações no Visual Studio em Ferramentas, Opções, Ferramentas para Apache Cordova, Configuração do Agente Remoto para usar este agente:",
    "",
    "Habilitar o processamento remoto de iOS: verdadeiro",
    "Host: {0}",
    "Porta: {1}",
    "Modo de segurança: verdadeiro",
    "PIN de segurança: {2}",
    "",
    "Como alternativa, use a execução taco-cli 'taco remote add <PLATFORM>' para configurar o taco CLI para usar este servidor de compilação para a plataforma escolhida, especificando",
    "Host: {0}",
    "Porta: {1}",
    "PIN: {2}"
  ],
  "OSXCertSetupNoPinTimeout": "O PIN de segurança é para uso uma única vez. Para gerar PINs adicionais, use o seguinte comando:",
  "OSXCertSetupPinTimeout": "O PIN de segurança é para uso uma única vez e expira em {0} minutos. Para gerar PINs adicionais, use o seguinte comando:",
  "CertExpirationInvalid": "certExpirationDays {0} resultaria em certificados expirados. Por isso, {1} dias padrão de expiração do certificado serão usados.",
  "CertificatesNotConfigured": "Erro: certificados ainda não inicializados!",
  "OSXResetServerCertQuery": "Aviso: este comando exclui todos os certificados de cliente atuais. Você precisará gerar e configurar um novo PIN de segurança. Deseja continuar? [S]im ou [N]ão",
  "OSXNoteAfterResetServerCert": "Nota: você precisa reiniciar todos os servidores remotebuild em execução antes que os novos certificados sejam usados.",
  "OSXResetServerCertResponseYes": [
    "s",
    "sim"
  ],
  "OSXResetServerCertResponseNo": [
    "n",
    "não"
  ],
  "OSXResetServerCertPleaseYesNo": "Responda [S]im ou [N]ão.",
  "CommandTestDescription": "Executa testes em relação a remotebuild",
  "CommandTestDevice": "Testa se o computador está configurado para compilações do dispositivo",
  "RemoteBuildTestExample1": "Execute testes em um servidor iniciado usando todos os padrões",
  "RemoteBuildTestExample2": "Execute testes de dispositivo em um servidor iniciado com 'remotebuild --config config.json'",
  "RunningAsRootError": "****** remotebuild não deve ser executado como raiz. Encerrando.",
  "ServerStartFailed": "****** Falha ao iniciar o servidor: {0}",
  "InsecureServerStarted": "Servidor de build remoto escutando na porta [http] {0}",
  "SecureServerStarted": "Servidor de build remoto escutando na porta [https] {0}",
  "ServerPortInUse": "Não é possível iniciar o servidor na porta {0}. O endereço já está em uso.",
  "UncaughtErrorShutdown": "****** O servidor será desligado devido a um erro não detectado ****** ",
  "ServerShutdown": "****** Executando os procedimentos de desligamento.",
  "TestFailed": "Erro: o teste {0} falhou.",
  "TestPassed": "O teste {0} foi aprovado."
}