{
  "IndexPageContent": "Zdalny serwer kompilacji Express gotowy do działania na porcie {0}",
  "NoServerModulesSelected": "Ostrzeżenie: Nie wybrano modułów serwera. Przyjęto wartość domyślną konfiguracji \"modules\": {\"taco-remote\": { \"mountPath\": \"cordova\"} }",
  "UnableToLoadModule": "Błąd: nie można załadować modułu {0}. Spróbuj uruchomić polecenie „npm install {0}” lub określić pełną ścieżkę do pakietu",
  "InvalidPortSpecified": "Określono nieprawidłowy port „{0}”. Port musi być liczbą całkowitą z zakresu od 0 do 65536.",
  "UnauthorizedClientRequest": "Zdalny serwer kompilacji odmówił wykonania żądania kompilacji, ponieważ certyfikat klienta jest nieprawidłowy lub utracił ważność. Aby skompilować projekt, musisz wygenerować i skonfigurować zabezpieczający numer PIN. Zobacz http://go.microsoft.com/fwlink/?LinkID=511904.",
  "InvalidPIN": "Nieprawidłowy numer PIN w żądaniu",
  "ClientCertNotFoundForPIN": "Nie znaleziono certyfikatu klienta dla numeru PIN",
  "CAFilesNotFound": "Nie znaleziono co najmniej jednego z wymaganych plików urzędu certyfikacji {0} i {1}.",
  "NoResourcesForLanguage": "Nie zdefiniowano zasobów dla języka {0}",
  "UnknownCommand": "Nieznane polecenie: {0}",
  "CommandStartDescription": "Uruchamia serwer",
  "CommandCertificatesDescription": "Aktualizuje certyfikaty SSL klienta/serwera na potrzeby bezpiecznego połączenia",
  "CommandGenerateDescription": "Generuje nowy certyfikat protokołu SSL klienta na potrzeby konfigurowania nowego bezpiecznego połączenia",
  "CommandResetDescription": "Resetuje certyfikaty SSL serwera",
  "CommandVersionDescription": "Wyświetla wersję bieżącego polecenia remotebuild",
  "CommandHelpDescription": "Wyświetla pomoc dla polecenia lub modułu",
  "CommandSaveConfigDescription": "Zapisuje określoną konfigurację do pliku.",
  "SavedConfig": "Konfiguracja została zapisana pomyślnie w {0}.",
  "CheckSettingsForInfo": "Przejrzyj/zmodyfikuj konfigurację serwera w ścieżce {0}. Do jej wygenerowania może być konieczne użycie polecenia „remotebuild saveconfig”. Musisz uruchomić ponownie serwer, jeśli zaktualizujesz konfiguracje serwera.",
  "RemoteBuildStartExample1": "Uruchamia serwer przy użyciu wszystkich wartości domyślnych (bezpieczny serwer z parametrem serverDir o wartości $TACO_HOME/remote-builds, port 3000)",
  "RemoteBuildStartExample2": "Uruchamianie serwera z innym katalogiem serverDir, portem i protokołem HTTP (tryb niezabezpieczony)",
  "GenerateClientCertExample1": "Generuje nowy certyfikat do użycia przez klienta z okresem ważności 1 roku",
  "ResetServerCertExample1": "Resetowanie certyfikatów serwera tak, aby ich ważność wygasła za 1 rok",
  "RemoteBuildModuleHelpText": "Inne opcje są opisane w poszczególnych modułach. Spróbuj skorzystać z pomocy następujących modułów: {0}.<br/>Na przykład „remotebuild help taco-remote”.",
  "RemoteBuildConfConfigFile": "Ścieżka do pliku konfiguracji, który określa domyślne wartości dla polecenia remotebuild",
  "UnableToFindModule": "Nie można załadować modułu „{0}”.",
  "RemoteBuildConfConfig": "Ścieżka do pliku json konfiguracji serwera z dowolnymi spośród tych ustawień (jeśli nie zostanie określona, przyjmowana jest wartość domyślna $TACO_HOME/RemoteBuild.config)",
  "RemoteBuildConfServerDir": "Katalog główny serwera (jeśli nie zostanie określony, wartością domyślną będzie $TACO_HOME/remote-builds)",
  "RemoteBuildConfLang": "Język do użycia dla danych wyjściowych konsoli (jeśli nie jest określony, domyślnie jest używany język określony przez zmienną środowiskową $LANG)",
  "RemoteBuildConfPort": "Numer portu serwera (jeśli nie zostanie określony, wartością domyślną będzie 3000)",
  "RemoteBuildConfSecure": "Wartość true dla protokołu HTTP z certyfikatami SSL serwera/klienta, wartość false dla zwykłego protokołu HTTP (jeśli nie zostanie określona, wartością domyślną będzie true)",
  "RemoteBuildConfPinTimeout": "Czas w minutach, przez który można uzyskać certyfikaty SSL klienta (domyślnie 10 minut)",
  "RemoteBuildConfHostname": "Nazwa hosta, dla którego mają zostać wygenerowane certyfikaty SSL w trybie zabezpieczonym (domyślną nazwę określa funkcja os.hostname())",
  "RemoteBuildConfCertExpirationDays": "Liczba dni do wygaśnięcia wygenerowanych certyfikatów SSL (jeśli nie zostanie określona, przyjmowana jest wartość domyślna wynosząca 5 lat)",
  "RemoteBuildNotes1": "Opcje (Wszystkie opcje inne niż --config można określić za pomocą pliku konfiguracji)",
  "RemoteBuildNotes2": "Opcje wiersza polecenia przesłaniają wartości w pliku konfiguracji",
  "OSXCertSetupInformation": [
    "Użyj następujących informacji w programie Visual Studio w obszarze Narzędzia, Opcje, Narzędzia dla oprogramowania Apache Cordova, Konfiguracja agenta zdalnego, aby skorzystać z tego agenta:",
    "",
    "Włącz zdalne przetwarzanie w systemie iOS: True",
    "Host: {0}",
    "Port: {1}",
    "Tryb zabezpieczony: True",
    "Zabezpieczający numer PIN: {2}",
    "",
    "Aby użyć programu taco-cli, możesz też uruchomić polecenie „taco remote add <PLATFORMA>” w celu skonfigurowania interfejsu wiersza polecenia programu taco pod kątem użycia tego serwera kompilacji dla wybranej platformy, określając",
    "Host: {0}",
    "Port: {1}",
    "Numer PIN: {2}"
  ],
  "OSXCertSetupNoPinTimeout": "Ten zabezpieczający numer PIN jest przeznaczony do jednorazowego użytku. Aby wygenerować dodatkowe numery PIN, użyj następującego polecenia:",
  "OSXCertSetupPinTimeout": "Ten zabezpieczający numer PIN jest przeznaczony do jednorazowego użytku i wygasa za {0} min. Aby wygenerować dodatkowe numery PIN, użyj następującego polecenia:",
  "CertExpirationInvalid": "Podanie dla parametru certExpirationDays wartości {0} spowodowałoby wygaśnięcie certyfikatów. Zostanie użyty domyślny okres ważności certyfikatów — {1} dni.",
  "CertificatesNotConfigured": "Błąd: Certyfikaty nie zostały jeszcze zainicjowane!",
  "OSXResetServerCertQuery": "Ostrzeżenie: To polecenie usuwa wszystkie bieżące certyfikaty klientów. Będzie konieczne wygenerowanie i skonfigurowanie nowego zabezpieczającego numeru PIN. Czy chcesz kontynuować? [T]ak lub [N]ie",
  "OSXNoteAfterResetServerCert": "Uwaga: aby móc użyć nowych certyfikatów, musisz ponownie uruchomić zdalne serwery kompilacji.",
  "OSXResetServerCertResponseYes": [
    "t",
    "tak"
  ],
  "OSXResetServerCertResponseNo": [
    "n",
    "nie"
  ],
  "OSXResetServerCertPleaseYesNo": "Odpowiedz [T]ak lub [N]ie.",
  "CommandTestDescription": "Uruchom testy dla polecenia remotebuild",
  "CommandTestDevice": "Testuje, czy maszyna jest skonfigurowana pod kątem kompilacji urządzenia",
  "RemoteBuildTestExample1": "Uruchom testy dla serwera uruchomionego za pomocą wszystkich wartości domyślnych",
  "RemoteBuildTestExample2": "Uruchom testy urządzenia dla serwera uruchomionego za pomocą polecenia „remotebuild --config config.json”",
  "RunningAsRootError": "****** remotebuild nie powinien być uruchamiany jako program główny. Trwa zamykanie.",
  "ServerStartFailed": "****** Nie można uruchomić serwera: {0}",
  "InsecureServerStarted": "Zdalny serwer kompilacji nasłuchujący na porcie [http] {0}",
  "SecureServerStarted": "Zdalny serwer kompilacji nasłuchujący na porcie [https] {0}",
  "ServerPortInUse": "Nie można uruchomić serwera na porcie {0}. Adres jest już używany.",
  "UncaughtErrorShutdown": "****** Serwer zostanie zamknięty z powodu nieprzechwyconego błędu ****** ",
  "ServerShutdown": "****** Wykonywanie procedur zamykania serwera.",
  "TestFailed": "Błąd: niepowodzenie testu {0}.",
  "TestPassed": "Test {0} zakończony powodzeniem."
}