{
  "IndexPageContent": "Servidor Express de la compilación remota listo para su uso en el puerto {0}",
  "NoServerModulesSelected": "Advertencia: no hay módulos de servidor seleccionados. Se va a establecer de forma predeterminada la configuración \"modules\": {\"taco-remote\": { \"mountPath\": \"cordova\"} }",
  "UnableToLoadModule": "Error: no se puede cargar el módulo {0}. Ejecute 'npm install {0}' o especifique la ruta de acceso completa al paquete",
  "InvalidPortSpecified": "Se especificó un puerto \"{0}\" no válido. El puerto debe ser un número entero entre 0 y 65536",
  "UnauthorizedClientRequest": "El servidor de compilación remota denegó la solicitud de compilación porque el certificado de cliente no es válido o expiró. Para compilar un proyecto, debe generar y configurar un PIN de seguridad. Vea http://go.microsoft.com/fwlink/?LinkID=511904.",
  "InvalidPIN": "PIN no válido en la solicitud",
  "ClientCertNotFoundForPIN": "Certificado de cliente no encontrado para el PIN",
  "CAFilesNotFound": "De los dos archivos de la CA requeridos, {0} y {1}, no se encontró uno o ninguno de ellos.",
  "NoResourcesForLanguage": "No hay recursos definidos para el idioma {0}",
  "UnknownCommand": "Comando desconocido: {0}",
  "CommandStartDescription": "Inicia el servidor",
  "CommandCertificatesDescription": "Actualiza los certificados SSL de cliente o servidor para una conexión segura",
  "CommandGenerateDescription": "Genera un nuevo certificado SSL de cliente para configurar una nueva conexión segura",
  "CommandResetDescription": "Restablece los certificados SSL del servidor",
  "CommandVersionDescription": "Muestra la versión de remotebuild actual",
  "CommandHelpDescription": "Proporciona ayuda sobre un comando o un módulo",
  "CommandSaveConfigDescription": "Guarda la configuración especificada en un archivo.",
  "SavedConfig": "La configuración se guardó correctamente en {0}.",
  "CheckSettingsForInfo": "Vea o edite la configuración del servidor en {0}. Puede que deba ejecutar \"remotebuild saveconfig\" para generarla. Si actualiza las configuraciones del servidor, tendrá que reiniciar el servidor.",
  "RemoteBuildStartExample1": "Iniciar el servidor con todos los valores predeterminados (servidor seguro con serverDir $TACO_HOME/remote-builds, puerto 3000)",
  "RemoteBuildStartExample2": "Iniciar el servidor con un serverDir, un puerto y un http distintos (no seguros)",
  "GenerateClientCertExample1": "Generar un nuevo certificado para usarlo en el cliente que expirará en 1 año",
  "ResetServerCertExample1": "Restablecer certificados de servidor para que expiren en 1 año",
  "RemoteBuildModuleHelpText": "Las demás opciones se describen en los módulos individuales. Intente buscar ayuda para los siguientes módulos: {0}.<br/>Por ejemplo, \"remotebuild help taco-remote\"",
  "RemoteBuildConfConfigFile": "Ruta de acceso al archivo de configuración que especifica los valores predeterminados de remotebuild",
  "UnableToFindModule": "No se puede cargar el módulo '{0}'.",
  "RemoteBuildConfConfig": "Ruta de acceso al archivo json de configuración del servidor con cualquiera de estos valores (el valor predeterminado es $TACO_HOME/RemoteBuild.config si no se especifica)",
  "RemoteBuildConfServerDir": "Directorio raíz para el servidor (el valor predeterminado es $TACO_HOME/remote-builds si no es especifica otro)",
  "RemoteBuildConfLang": "Lenguaje usado para la salida de la consola (si no se especifica, el valor predeterminado es el que proporciona $LANG)",
  "RemoteBuildConfPort": "Número de puerto para el servidor (el valor predeterminado es 3000 si no se especifica otro)",
  "RemoteBuildConfSecure": "true para https con certificados SSL de servidor/cliente, false para http estándar (el valor predeterminado es true si no se especifica otro)",
  "RemoteBuildConfPinTimeout": "Tiempo en minutos durante el que se pueden adquirir los certificados SSL del cliente (el valor predeterminado es 10 minutos)",
  "RemoteBuildConfHostname": "Nombre del host para el que se generan los certificados SSL en modo seguro (el valor predeterminado es os.hostname())",
  "RemoteBuildConfCertExpirationDays": "Número de días transcurridos tras los cuales expirarán los certificados SSL generados (el valor predeterminado es de 5 años si no se especifica)",
  "RemoteBuildNotes1": "Opciones (todas las opciones distintas de --config se pueden especificar mediante un archivo de configuración)",
  "RemoteBuildNotes2": "Las opciones de la línea de comandos invalidan los valores del archivo de configuración",
  "OSXCertSetupInformation": [
    "Use la información siguiente en Visual Studio, en Herramientas, Opciones, Herramientas para Apache Cordova, Configuración de agente remoto para usar este agente:",
    "",
    "Habilitar el procesamiento remoto de iOS: true",
    "Host: {0}",
    "Puerto: {1}",
    "Modo seguro: true",
    "PIN de seguridad: {2}",
    "",
    "Otra opción es ejecutar 'taco remote add <PLATAFORMA>' en la interfaz taco-cli para configurar taco CLI de modo que use este servidor de compilación para la plataforma elegida, especificando",
    "Host: {0}",
    "Puerto: {1}",
    "PIN: {2}"
  ],
  "OSXCertSetupNoPinTimeout": "El PIN de seguridad es de un solo uso. Para generar más PIN, use el comando siguiente:",
  "OSXCertSetupPinTimeout": "El PIN de seguridad es de un solo uso y expira dentro de {0} minutos. Para generar más PIN, use el comando siguiente:",
  "CertExpirationInvalid": "El valor certExpirationDays {0} produciría certificados expirados. En su lugar se usará {1} días, que es el valor predeterminado de expiración de certificados.",
  "CertificatesNotConfigured": "Error: certificados todavía no inicializados.",
  "OSXResetServerCertQuery": "Advertencia: este comando elimina todos los certificados de cliente actuales. Tendrá que generar y configurar un nuevo PIN de seguridad. ¿Quiere continuar? [S]í o [N]o",
  "OSXNoteAfterResetServerCert": "Nota: tiene que reiniciar los servidores de remotebuild en ejecución para usar los nuevos certificados.",
  "OSXResetServerCertResponseYes": [
    "s",
    "sí"
  ],
  "OSXResetServerCertResponseNo": [
    "n",
    "no"
  ],
  "OSXResetServerCertPleaseYesNo": "Responda [S]í o [N]o.",
  "CommandTestDescription": "Ejecutar pruebas en remotebuild",
  "CommandTestDevice": "Probar que la máquina esté configurada para compilaciones de dispositivos",
  "RemoteBuildTestExample1": "Ejecutar pruebas en un servidor iniciado con todos los valores predeterminados",
  "RemoteBuildTestExample2": "Ejecutar pruebas de dispositivos en un servidor iniciado con el comando \"remotebuild --config config.json\"",
  "RunningAsRootError": "****** remotebuild no se debería ejecutar como raíz. Se va a cerrar.",
  "ServerStartFailed": "****** No se pudo iniciar el servidor: {0}",
  "InsecureServerStarted": "Servidor de compilación remota con escucha en el puerto [http] {0}",
  "SecureServerStarted": "Servidor de compilación remota con escucha en el puerto [https] {0}",
  "ServerPortInUse": "No se puede iniciar el servidor en el puerto {0}. La dirección ya está en uso.",
  "UncaughtErrorShutdown": "****** El servidor se cerrará debido a un error no detectado ****** ",
  "ServerShutdown": "****** Realizando procedimientos de cierre del servidor.",
  "TestFailed": "Error en la prueba de {0}.",
  "TestPassed": "La prueba de {0} se hizo correctamente."
}