{
  "InvalidBuildRequest": "Richiesta di compilazione non valida",
  "BuildNotFound": "La compilazione {0} non esiste",
  "BuildUploaded": "Payload della richiesta di compilazione caricato.",
  "BuildExtracted": "Contenuto dell'app estratto dalla richiesta di compilazione caricata",
  "BuildBuilding": "Compilazione dell'app Cordova.",
  "BuildComplete": "Compilazione completata.",
  "BuildDownloaded": "Compilazione completata e scaricata dal client.",
  "EmulateDisabled": "L'emulazione non è abilitata in questo server.",
  "NoResourcesForLanguage": "Non sono state definite risorse per la lingua {0}",
  "BuildRetentionPreDelete": "Eliminazione delle compilazioni idonee. Verranno eliminate {0} compilazioni.",
  "BuildRetentionDelete": "La compilazione {0} verrà eliminata da {1}",
  "BuildManagerDirInit": "La compilazione verrà eseguita in: {0}",
  "LogFileReadError": "Errore durante la lettura del file del log di compilazione {0}:",
  "UploadSavedSuccessfully": "La compilazione caricata è stata salvata in {0}",
  "UploadSaving": "Salvataggio del payload della richiesta di compilazione in: {0}",
  "ErrorSavingTgz": "Si è verificato un errore durante il salvataggio del file tgz caricato in {0}: {1}",
  "UploadExtractedSuccessfully": "Contenuto dell'app estratto dalla richiesta di compilazione caricata in {0}. Verrà richiesta la compilazione.",
  "NewBuildQueued": "È già in corso una compilazione. {0} verrà accodata",
  "NewBuildStarted": "{0} verrà considerata come compilazione corrente",
  "BuildDirectoryNotFound": "La directory di compilazione {0} non esiste.",
  "BuildMovingOn": "Le operazioni sulla compilazione corrente sono terminate. Verrà verificata la disponibilità di una nuova compilazione in coda.",
  "MalformedBuildInfo": "Non è stato trovato un pacchetto appropriato per la compilazione specificata",
  "NewBuildSubmitted": "Nuova richiesta di compilazione inviata:",
  "BuildQueueFull": "La richiesta di compilazione è stata rifiutata. La coda di compilazione è piena. Il limite è di {0} compilazioni in coda.",
  "FailedCreateDirectory": "Non è possibile creare la directory di estrazione {0}: {1}",
  "NoTgzFound": "Il file tgz di compilazione non esiste più nel file system in {0}",
  "TgzExtractError": "Si è verificato un errore durante l'estrazione del contenuto da {0}: {1}",
  "AttemptedDeleteFileOutsideProject": "Avviso: la compilazione ha richiesto l'eliminazione del file '{0}'",
  "BuildInvokedTwice": "Richiesta non valida: il processo build.js è già in uso ma è stato richiesto di eseguire nuovamente la compilazione. Si tratta probabilmente di un errore di programmazione perché il processo build.js deve essere usato una sola volta.",
  "BuildNotCompleted": "La compilazione richiesta non è ancora pronta. Stato: {0}",
  "ExceededMaxPings": "È stato superato il numero massimo di ping: {0}",
  "CordovaAcquisitionFailed": "Non è stato possibile caricare la versione {0} di Cordova: {1}",
  "FirstRunDependencyConfiguration": "Configurazione delle dipendenze per la prima esecuzione.\nPer eseguire la distribuzione in dispositivi iOS fisici o per eseguire il debug di un dispositivo o di un simulatore, sono necessari alcuni pacchetti Homebrew, un'utilità di gestione pacchetti di terze parti.\nSe si installa Homebrew, è possibile che venga richiesta una password di amministratore. Continuare?",
  "HomebrewInstallationQuery": "[s]/n? ",
  "HomebrewInstallationQueryResponse": "s",
  "HomebrewInstallationFailed": "Si è verificato un errore durante l'installazione dei pacchetti Homebrew:\n{0}",
  "HomebrewPackageVerificationFailed": "Si è verificato un errore durante la verifica dei pacchetti Homebrew:\n{0}\nEseguire \"brew reinstall libimobiledevice ios-webkit-debug-proxy ideviceinstaller\" e riprovare.",
  "HomebrewInstallationSuccess": "Installazione dei pacchetti Homebrew riuscita.\n",
  "HomebrewInstallationDeclined": "Per abilitare la distribuzione in dispositivi o il debug di app in dispositivi o nel simulatore, eliminare {0} in modo da visualizzare nuovamente il messaggio di richiesta.\n",
  "TacoRemoteHelpDescription": "taco-remote consente di compilare progetti Apache Cordova in modalità remota.",
  "TacoRemoteHelpNotes": "Per altre informazioni sulla configurazione della compilazione con taco-remote, vedere <link>http://go.microsoft.com/fwlink/?LinkId=618174</link>",
  "TacoRemoteHelpExample": "Usare il file di configurazione seguente per configurare la porta di remotebuild, la porta proxy del debug Web, nessuna conservazione di build e la pulizia delle build all'arresto",
  "TacoRemoteConfigAllowsEmulate": "È true se il server deve supportare l'esecuzione di compilazioni nel simulatore iOS; è false in caso contrario. Se non è specificata, viene usata l'impostazione predefinita true",
  "TacoRemoteConfigDeleteBuildsOnShutdown": "Elimina tutte le compilazioni quando il server viene arrestato. Se non è specificata, viene usata l'impostazione predefinita true",
  "TacoRemoteConfigMaxBuildsInQueue": "Numero massimo di compilazioni da consentire nella coda di compilazione. Le nuove compilazioni che superano questo limite vengono rifiutate. Se non è specificata, verrà usata l'impostazione predefinita 10",
  "TacoRemoteConfigMaxBuildsToKeep": "Numero massimo di compilazioni da conservare sul disco. Se non è specificata, verrà usata l'impostazione predefinita 20",
  "TacoRemoteConfigNativeDebugProxyPort": "Numero di porta del debugger nativo. Se non è specificata, verrà usata l'impostazione predefinita 3001",
  "TacoRemoteConfigWebDebugProxyDevicePort": "Numero di porta per l'individuazione del dispositivo del debugger WebKit. Se non è specificata, verrà usata l'impostazione predefinita 9221",
  "TacoRemoteConfigWebDebugProxyPortMin": "Primo numero di porta per il debugger WebKit da assegnare ai dispositivi. Se non è specificata, verrà usata l'impostazione predefinita 9222",
  "TacoRemoteConfigWebDebugProxyPortMax": "Ultimo numero di porta per il debugger WebKit da assegnare ai dispositivi. Se non è specificata, verrà usata l'impostazione predefinita 9322"
}