{
  "InvalidBuildRequest": "Nieprawidłowe żądanie kompilacji",
  "BuildNotFound": "Kompilacja {0} nie istnieje",
  "BuildUploaded": "Ładunek przekazanego żądania kompilacji.",
  "BuildExtracted": "Wyodrębniona zawartość aplikacji z przekazanego żądania kompilacji",
  "BuildBuilding": "Tworzenie aplikacji oprogramowania Cordova.",
  "BuildComplete": "Kompilacja została pomyślnie zakończona.",
  "BuildDownloaded": "Kompilacja została zakończona i pobrana przez klienta.",
  "EmulateDisabled": "Emulacja nie jest włączona na tym serwerze.",
  "NoResourcesForLanguage": "Nie zdefiniowano zasobów dla języka {0}",
  "BuildRetentionPreDelete": "Usuwanie uprawnionych kompilacji. Liczba kompilacji do usunięcia: {0}.",
  "BuildRetentionDelete": "Usuwanie kompilacji {0} z lokalizacji {1}",
  "BuildManagerDirInit": "Kompilacja zostanie wykonana w ścieżce {0}",
  "LogFileReadError": "Błąd odczytu pliku dziennika kompilacji {0}:",
  "UploadSavedSuccessfully": "Zapisano przekazaną kompilację w lokalizacji {0}",
  "UploadSaving": "Zapisywanie ładunku żądania kompilacji w lokalizacji {0}",
  "ErrorSavingTgz": "Wystąpił błąd podczas zapisywania przekazanego pliku tgz do pliku {0}: {1}",
  "UploadExtractedSuccessfully": "Wyodrębniono zawartość aplikacji z przekazanego żądania kompilacji do lokalizacji {0}. Żądanie kompilacji jest przesyłane.",
  "NewBuildQueued": "Kompilacja jest aktualnie kompilowana. Umieszczanie w kolejce kompilacji {0}.",
  "NewBuildStarted": "Ustawianie kompilacji {0} jako bieżącej",
  "BuildDirectoryNotFound": "Katalog kompilacji {0} nie istnieje.",
  "BuildMovingOn": "Bieżąca kompilacja jest gotowa. Sprawdzanie następnej kompilacji w kolejce.",
  "MalformedBuildInfo": "Nie można znaleźć odpowiedniego pakietu dla określonej kompilacji",
  "NewBuildSubmitted": "Przesłano nowe żądanie kompilacji:",
  "BuildQueueFull": "Żądanie kompilacji zostało odrzucone. Kolejka kompilacji jest pełna. Limit liczby kompilacji w kolejce to {0}.",
  "FailedCreateDirectory": "Nie można utworzyć katalogu na potrzeby wyodrębniania {0}: {1}",
  "NoTgzFound": "Pliku tgz kompilacji nie ma już w ścieżce {0} systemu plików",
  "TgzExtractError": "Wystąpił błąd podczas wyodrębniania zawartości z pliku {0}: {1}",
  "AttemptedDeleteFileOutsideProject": "Ostrzeżenie: kompilacja zażądała usunięcia pliku „{0}”",
  "BuildInvokedTwice": "Nieprawidłowe żądanie: proces build.js jest już używany, lecz zażądano ponownie, aby wykonał kompilację. Prawdopodobnie jest to błąd programistyczny, ponieważ proces build.js jest przeznaczony do jednokrotnego użycia.",
  "BuildNotCompleted": "Żądana kompilacja nie jest jeszcze gotowa. Stan: {0}",
  "ExceededMaxPings": "Przekroczono maksymalną liczbę żądań ping: {0}",
  "CordovaAcquisitionFailed": "Nie można załadować oprogramowania Cordova {0}: {1}",
  "FirstRunDependencyConfiguration": "Konfigurowanie zależności dla pierwszego uruchomienia.\nAby wdrożyć na fizycznych urządzeniach z systemem iOS albo debugować urządzenie lub symulator, potrzebujemy niektórych pakietów programu Homebrew — menedżera pakietów innej firmy.\nPodczas instalacji programu Homebrew może zostać wyświetlone pytanie o hasło administratora. Czy chcesz kontynuować?",
  "HomebrewInstallationQuery": "[t]/n? ",
  "HomebrewInstallationQueryResponse": "t",
  "HomebrewInstallationFailed": "Błąd podczas instalowania pakietów oprogramowania Homebrew:\n{0}",
  "HomebrewPackageVerificationFailed": "Błąd podczas sprawdzania poprawności pakietów oprogramowania Homebrew:\n{0}\nRozważ użycie polecenia „brew reinstall libimobiledevice ios-webkit-debug-proxy ideviceinstaller” i podjęcie ponownej próby.",
  "HomebrewInstallationSuccess": "Pomyślnie zainstalowano pakiety oprogramowania Homebrew.\n",
  "HomebrewInstallationDeclined": "Jeśli chcesz włączyć wdrażanie na urządzeniach albo debugowanie aplikacji na urządzeniach lub symulatorze, usuń element {0}, co spowoduje ponowne wyświetlenie pytania.\n",
  "TacoRemoteHelpDescription": "Polecenie taco-remote umożliwia zdalne kompilowanie projektów programu Apache Cordova.",
  "TacoRemoteHelpNotes": "Więcej dokumentacji na temat konfigurowania zdalnej kompilacji programu taco można znaleźć w artykule  <link>http://go.microsoft.com/fwlink/?LinkId=618174</link>",
  "TacoRemoteHelpExample": "Użyj następującego pliku konfiguracji, aby skonfigurować port polecenia remotebuild, port serwera proxy debugowania w sieci Web, wyłączyć zachowywanie kompilacji i włączyć czyszczenie kompilacji podczas wyłączania",
  "TacoRemoteConfigAllowsEmulate": "Wartość true powoduje, że serwer obsługuje uruchamianie kompilacji na symulatorze systemu iOS, a wartość false wyłącza tę możliwość (wartość domyślna to true, jeśli nie zostanie określona)",
  "TacoRemoteConfigDeleteBuildsOnShutdown": "Usuń wszystkie kompilacje przy zamykaniu serwera (wartość domyślna to true, jeśli nie zostanie określona)",
  "TacoRemoteConfigMaxBuildsInQueue": "Maksymalna dozwolona liczba kompilacji w kolejce kompilacji. Nowe kompilacje ponad ten limit będą odrzucane (wartość domyślna to 10, jeśli nie zostanie określona).",
  "TacoRemoteConfigMaxBuildsToKeep": "Maksymalna liczba kompilacji do zachowania na dysku (wartość domyślna to 20, jeśli nie zostanie określona)",
  "TacoRemoteConfigNativeDebugProxyPort": "Numer portu natywnego debugera (wartość domyślna to 3001, jeśli nie zostanie określona)",
  "TacoRemoteConfigWebDebugProxyDevicePort": "Numer portu dla odnajdywania urządzenia debugera WebKit (wartość domyślna to 9221, jeśli nie zostanie określona)",
  "TacoRemoteConfigWebDebugProxyPortMin": "Pierwszy numer portu przypisywany urządzeniom przez debuger WebKit (wartość domyślna to 9222, jeśli nie zostanie określona)",
  "TacoRemoteConfigWebDebugProxyPortMax": "Ostatni numer portu przypisywany urządzeniom przez debuger WebKit (wartość domyślna to 9322, jeśli nie zostanie określona)"
}